In [6]:
import pandas as pd

* 딕셔너리 -> 데이터프레임

In [8]:
dict_data = {'c0':[1,2,3],
             'c1':[4,5,6],
             'c2':[7,8,9],
             'c3':[10,11,12],
             'c4':[13,14,15]}

In [13]:
df1 = pd.DataFrame(dict_data)
df1

   c0  c1  c2  c3  c4
0   1   4   7  10  13
1   2   5   8  11  14
2   3   6   9  12  15

* 2차원 배열(List) -> 데이터프레임

In [10]:
array_data = [[15, '남', '덕영중'], 
              [17, '여', '수리중']]

In [14]:
df2 = pd.DataFrame(array_data,
                  index = ['준서', '예은'],
                  columns = ['나이', '성별', '학교'])
df2

    나이 성별   학교
준서  15  남  덕영중
예은  17  여  수리중

* 행 인덱스 변경, 컬럼명 변경

In [16]:
df2.index = ['학생1', '학생2']
df2.columns = ['age', 'sex', 'school']
df2

     age sex school
학생1   15   남    덕영중
학생2   17   여    수리중

In [17]:
df2.rename(index={'학생1':'s1', '학생2':'s2'}, inplace=True)
df2.rename(columns={'school':'middle_school'}, inplace=True)
df2

    age sex middle_school
s1   15   남           덕영중
s2   17   여           수리중

* 행/열 삭제

In [19]:
dict_score = {'수학':[90,80,70],
              '영어':[98,89,95],
              '음악':[87,88,89],
              '체육':[100,91,72]}
df3 = pd.DataFrame(dict_score)
df3

   수학  영어  음악   체육
0  90  98  87  100
1  80  89  88   91
2  70  95  89   72

In [20]:
df3.drop(1, axis=0, inplace=True)
df3

   수학  영어  음악   체육
0  90  98  87  100
2  70  95  89   72

In [21]:
df3.drop(['수학', '음악'], axis=1, inplace=True)
df3

   영어   체육
0  98  100
2  95   72

* 행 선택: loc(), iloc()
* loc() : 인덱스 이름
* iloc() : 정수형 위치 인덱스

In [30]:
studnet_data = [[15, '남', '덕영중'],
                [17, '남', '월서중'], 
                [17, '여', '수리중']]
df4 = pd.DataFrame(studnet_data,
                  index = ['준서', '예은', '우현'],
                  columns = ['나이', '성별', '학교'])
df4

    나이 성별   학교
준서  15  남  덕영중
예은  17  남  월서중
우현  17  여  수리중

In [25]:
df4.loc['준서']

나이     15
성별      남
학교    덕영중
Name: 준서, dtype: object

In [32]:
df4.loc[['준서','우현']]

    나이 성별   학교
준서  15  남  덕영중
우현  17  여  수리중

In [33]:
df4.iloc[1]

나이     17
성별      남
학교    월서중
Name: 예은, dtype: object

In [35]:
df4.iloc[1:3]   # 인덱스 1, 2

    나이 성별   학교
예은  17  남  월서중
우현  17  여  수리중

* 열 선택

In [36]:
df4

    나이 성별   학교
준서  15  남  덕영중
예은  17  남  월서중
우현  17  여  수리중

In [37]:
df4['학교']

준서    덕영중
예은    월서중
우현    수리중
Name: 학교, dtype: object

In [38]:
df4.학교

준서    덕영중
예은    월서중
우현    수리중
Name: 학교, dtype: object

* 원소 선택
* loc(행 이름, 열 이름)
* iloc(행 인덱스, 열 번호)

In [42]:
df4

    나이 성별   학교
준서  15  남  덕영중
예은  17  남  월서중
우현  17  여  수리중

In [46]:
df4.loc['예은', ['나이', '학교']]

나이     17
학교    월서중
Name: 예은, dtype: object

In [53]:
df4.iloc[1, [0,2]]

나이     17
학교    월서중
Name: 예은, dtype: object

* 열 추가

In [54]:
df4

    나이 성별   학교
준서  15  남  덕영중
예은  17  남  월서중
우현  17  여  수리중

In [56]:
df4['지역'] = '대구'
df4

    나이 성별   학교  지역
준서  15  남  덕영중  대구
예은  17  남  월서중  대구
우현  17  여  수리중  대구

In [58]:
df4['시군구'] = ['달서구', '중구', '남구']
df4

    나이 성별   학교  지역  시군구
준서  15  남  덕영중  대구  달서구
예은  17  남  월서중  대구   중구
우현  17  여  수리중  대구   남구

* 특정 원소의 값 변경

In [59]:
df4

    나이 성별   학교  지역  시군구
준서  15  남  덕영중  대구  달서구
예은  17  남  월서중  대구   중구
우현  17  여  수리중  대구   남구

In [62]:
df4.loc['예은','나이'] = 16
df4

    나이 성별   학교  지역  시군구
준서  15  남  덕영중  대구  달서구
예은  16  남  월서중  대구   중구
우현  17  여  수리중  대구   남구

In [63]:
# 여러 항목 변경
df4.loc['우현', ['나이', '학교']] = [15, '우리중']
df4

    나이 성별   학교  지역  시군구
준서  15  남  덕영중  대구  달서구
예은  16  남  월서중  대구   중구
우현  15  여  우리중  대구   남구

* 행과 열의 위치 변경: transpose()

In [64]:
dict_score = {'수학':[90,80,70],
              '영어':[98,89,95],
              '음악':[87,88,89],
              '체육':[100,91,72]}
df5 = pd.DataFrame(dict_score, 
                   index = ['서준', '우현', '인아'])
df5

    수학  영어  음악   체육
서준  90  98  87  100
우현  80  89  88   91
인아  70  95  89   72

In [65]:
df5.transpose()

     서준  우현  인아
수학   90  80  70
영어   98  89  95
음악   87  88  89
체육  100  91  72

In [66]:
df5.T

     서준  우현  인아
수학   90  80  70
영어   98  89  95
음악   87  88  89
체육  100  91  72

* 데이터프레임 정렬: sort_index(), sort_values()

In [68]:
df5.sort_index(ascending=False)

    수학  영어  음악   체육
인아  70  95  89   72
우현  80  89  88   91
서준  90  98  87  100

In [71]:
df5.sort_values(by='영어', ascending=False)
df5

    수학  영어  음악   체육
서준  90  98  87  100
우현  80  89  88   91
인아  70  95  89   72